# RollBackPendingTransaction Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..RollBackPendingTransaction Method
FailuresAccessor Class See Also
---
Finishes pending failures processing by rolling back the pending transaction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TransactionStatus RollBackPendingTransaction()
```

Visual Basic
---
```text
Public Function RollBackPendingTransaction As TransactionStatus
```

Visual C++
---
```text
public:
TransactionStatus RollBackPendingTransaction()
```

# ### Return Value
Result of attempt to roll back the pending transaction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). -or- The processing of the failures is not in the pending state. |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace